In [2]:
import sqlalchemy as sa
import pandas as pd

from creds import postgres_url

# pip install psycopg2-binary
engine = sa.create_engine(postgres_url)

In [3]:
pd.read_sql('people', engine).to_sql('peoples', engine, if_exists='replace', index=False)

In [4]:
df = pd.read_sql('peoples', engine)
df

   id    name  age  address_id
0   1  Olivia   17           1
1   4    Noah   20           2
2   2    Liam   19           1
3   3    Emma   20           2

In [27]:
class IDataLayer:
    def store(self, df: pd.DataFrame, name: str) -> None:
        pass
    
    def load(self, name: str) -> pd.DataFrame:
        pass
    
    
class SqlDataLayer(IDataLayer):
    def __init__(self, engine):
        self.engine = engine
        
    def store(self, df: pd.DataFrame, name: str) -> None:
        store_df_sql(df, name, self.engine)
    
    def load(self, name: str) -> pd.DataFrame:
        return load_df_sql(name, self.engine)
    

def df_metadata(df: pd.DataFrame) -> pd.DataFrame:
    columns = pd.DataFrame({'column': df.columns,
                            'index': False,
                            'datatype': [str(dt) for dt in df.dtypes]})
    indexes = pd.DataFrame({'column': [f'_no_name_{i}' if name==None else name for i, name in enumerate(df.index.names)],
                            'index': True,
                            'datatype': str(df.index.dtype) if len(df.index.names)==1
                                            else [str(dt) for dt in df.index.dtypes]})
    return indexes.append(columns).reset_index(drop=True)

        
def unname_no_names(df) -> None:
    if len(df.index.names)==1:
        if df.index.name == '_no_name':
            df.index.name = None
    else:
        df.index.names = [None if name==f'_no_name_{i}' else name for i, name in enumerate(df.index.names)]
    
    
def name_no_names(df) -> None:
    if len(df.index.names)==1:
        if df.index.name == None:
            df.index.name = '_no_name'
    else:
        df.index.names = [f'_no_name_{i}' if name==None else '_no_name_' for i, name in enumerate(df.index.names)]
    
    
def store_df_sql(df: pd.DataFrame, table_name: str, engine: sa.engine.Engine) -> None:
    df = df.copy()
    name_no_names(df)
    metadata = df_metadata(df)
    df.to_sql(table_name, engine, if_exists='replace')
    metadata.to_sql(f'_{table_name}_metadata', engine, if_exists='replace', index=False)
    
    
def cast_type(series):
    return [pd.core.dtypes.cast.pandas_dtype(n) for n in series]


def read_cast_metadata_sql(table_name, engine):
    meta = pd.read_sql(table_name, engine)
    meta['datatype'] = cast_type(meta['datatype'])
    return meta


def convert_meta_to_dict(meta: pd.DataFrame) -> dict:
    return {col: typ for col, typ in zip(meta['column'], meta['datatype'])}


def load_df_sql(table_name, engine):
    meta_name = f'_{table_name}_metadata'
    metadata = read_cast_metadata(meta_name, engine)
    types = convert_meta_to_dict(metadata)
    indexes = list(metadata['column'][metadata['index']==True])
    df = pd.read_sql(table_name, engine).astype(types).set_index(indexes)
    unname_no_names(df)
    return df

In [28]:
dl = SqlDataLayer(engine)
dl.store(df, 'peoples')
df

TypeError: store() takes 2 positional arguments but 3 were given

In [26]:
pd.read_sql('peoples', engine)

   _no_name_0  _no_name_1    name  age  address_id
0           0           1  Olivia   17           1
1           1           4    Noah   20           2
2           2           2    Liam   19           1
3           3           3    Emma   20           2

In [20]:
pd.read_sql_table('_peoples_metadata', engine)

       column  index datatype
0    _no_name   True    int64
1          id  False    int64
2        name  False   object
3         age  False    int64
4  address_id  False    int64

In [21]:
restore_df('peoples', engine)

   id    name  age  address_id
0   1  Olivia   17           1
1   4    Noah   20           2
2   2    Liam   19           1
3   3    Emma   20           2

In [22]:
df = df.reset_index().set_index(['index', 'id'])

In [23]:
df.index.names = [None, None]
df

       name  age  address_id
0 1  Olivia   17           1
1 4    Noah   20           2
2 2    Liam   19           1
3 3    Emma   20           2

In [ ]:
df.to_sql('peoples_2', engine)
pd.read_sql_table('peoples_2', engine)

In [24]:
store_df(df, 'peoples', engine)
df

       name  age  address_id
0 1  Olivia   17           1
1 4    Noah   20           2
2 2    Liam   19           1
3 3    Emma   20           2

In [25]:
restore_df('peoples', engine)

       name  age  address_id
0 1  Olivia   17           1
1 4    Noah   20           2
2 2    Liam   19           1
3 3    Emma   20           2

In [ ]:
pd.read_sql_table('_peoples_metadata', engine)

In [ ]:
df['index'] = df.index.values

In [ ]:
df.set_index(['id', 'index'], inplace=True)

In [ ]:
df['name'] = df['name'].astype('string')

In [ ]:
df

In [ ]:
df.to_sql('peoples', engine, if_exists='replace')

In [ ]:
pd.read_sql('peoples', engine)

In [ ]:
meta = df_metadata(df)
meta

In [ ]:
meta.to_sql('peoples_metadata', engine, if_exists='replace', index=False)

In [ ]:
new_meta = read_cast_metadata('_peoples_metadata', engine)
new_meta

In [ ]:
d = convert_meta_to_dict(new_meta)
d

In [ ]:
pd.read_sql('peoples', engine)

In [ ]:
restore_df('peoples', engine)

In [ ]:
indexed = list(new_meta['column'][new_meta['index']==True])
indexed

In [ ]:
pd.read_sql('peoples', engine)

In [ ]:
pd.read_sql('peoples', engine).astype(d).set_index(indexed)

In [ ]:
np.dtype('int64')